import React from "react";
// import { Link } from "react-scroll";

// const settings = {
//   spy: true,
//   smooth: true,
//   offset: -50,
//   duration: 800
// };

// Settings for react-scroll

const About = () => {
  return (
    <div className="about">
      <div className="about__wrapper">
        <div className="about__info">
          <div className="about__title">О компании</div>
          <div className="about__content">
            Компания «ПрофВектор» оказывает консалтинговые услуги организациям,
            которые столкнулись с проверкой со стороны госорганов. Став нашим
            партнёром, вы всегда остаётесь в курсе, что конкретно инспектируют в
            ходе проверки и будете готовы к любым вопросам.
            <br />
            <br />
            Наши услуги будут полезны организациям, которые стремятся соблюдать
            законодательство РФ. Работая с нами, вы будете уверены в полном
            соответствии вашего предприятия всем необходимым требованиям
            госорганов.
            <br />
            <br />
            «ПрофВектор» более 6 лет оказывает консультационную помощь в области
            охраны труда, эпидемиологической и пожарной безопасности, а также
            занимается разработкой необходимой документации для проверок со
            стороны Роспотребнадзора (СЭС, ФБУЗ «Центра гигиены и
            эпидемиологии»), МЧС и РОСТРУД (Государственной инспекции труда).
            <br />
            <br />
            Мы поддерживаем постоянную связь с сотрудниками государственных
            организаций, следим за актуальными изменениями в законодательстве и
            передаём эти знания вам, для вашей дальнейшей спокойной и
            плодотворной работы. Мы помогаем предпринимателям сохранить их
            деньги и время.
            <br/>
            <br/>
            Оказываем консалтинговые услуги всем, кто столкнулся <br /> с
            проверками со стороны Роспотребнадзора, МЧС и РОСТРУДа
            (Государственной инспекции труда):
            <ul>
              <li>1) Расшифровка основных правил и системы штрафов.</li>
              <li>2) Подготовка алгоритма действий при проверках.</li>
              <li>3) Сбор необходимых документов.</li>
              <li>4) Отмена штрафов.</li>
            </ul>
          </div>
        </div>
        <div></div>
      </div>
    </div>
  );
};

export default About;
